/**
 * 小程序配置文件
 */

// 此处主机域名修改成腾讯云解决方案分配的域名]

var host = 'https://mpg.kuaishouvideo.com';

var config = {
    // header内的小程序包信息
    headerInfo: {
        version: '1.0.0',
        product: 'anonymitySay',
        platform: ''
    },
    // 下面的地址配合云端 Demo 工作
    service: {
        host,

        // 登录地址，用于建立会话
        loginUrl: `${host}/game/user/login`,

        // 测试的请求地址，用于测试会话
        requestUrl: `${host}/weapp/user`,

        // 上传图片接口
        uploadUrl: `${host}/weapp/upload`
    },
    // 视频加载状态提示
    videoStatus: {
        2008: '解码器启动',
        2001: '已经连接服务器',
        2002: '开始拉流',
        2004: '准备播放视频',
        2006: '视频播放结束',
        2007: '视频缓冲中...',
        2009: '更新分辨率', //视频分辨率改变
        2003: '加载完成',
        '-2301': '网络断连，且经多次重连抢救无效，更多重试请自行重启播放',
        '-2302': '获取加速拉流地址失败',
        2101: '当前视频帧解码失败',
        2102: '当前音频帧解码失败',
        2103: '网络断连, 已启动自动重连',
        2104: '网络来包不稳：可能是下行带宽不足，或由于主播端出流不均匀',
        2105: '视频播放卡顿',
        2106: '硬解启动失败，采用软解',
        2107: '视频帧不连续，可能丢帧',
        2108: '当前流硬解第一个I帧失败，SDK自动切软解',
        3001: 'RTMP -DNS解析失败',
        3002: 'RTMP服务器连接失败',
        3003: 'RTMP服务器握手失败',
        3005: 'RTMP 读/写失败',
        6000: '拉流被挂起'
    }
};

module.exports = config;
